
#************************************************ Домашнее задание *****************************************************
#**************************************(Организация программ и методы строк) *******************************************


#                         Практическая работа по уроку "Организация программ и методы строк"

#                         Цель: Написать программу на языке Python с использованием Pycharm
#                                 для работы с методами строк и организации программ.


# Задаие №1:

# 1. Организуйте программу:

   # Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
   #Вывести количество символов введённого текста

# 2. Работа с методами строк:

   #Используя методы строк, выполните следующие действия:

   # Выведите строку my_string в верхнем регистре.
   # Выведите строку my_string в нижнем регистре.
   # Измените строку my_string, удалив все пробелы.
   # Выведите первый символ строки my_string.
   # Выведите последний символ строки my_string.
#-----------------------------------------------------------------------------------------------------------------------

# Ответ:
# Задание №1:

my_string = ("Ни хрена не успеваю") # - Ни хрена не успеваю

my_string = input("Ни хрена не успеваю")

print(type(my_string)) # - <class 'str'>

my_string = (input(len("Ни хрена не успеваю"))) # 19

my_string = input("Ни хрена не успеваю". upper()) # - НИ ХРЕНА НЕ УСПЕВАЮ

my_string = input("Ни хрена не успеваю". lower()) # - ни хрена не успеваю

my_string = input("Ни хрена не успеваю". lower(). upper()) # - НИ ХРЕНА НЕ УСПЕВАЮ

my_string = input("Ни хрена не успеваю". replace(' ', '#')) # - Ни#хрена#не#успеваю

name = ("my_string")

print(name[0]) # - m

print(name[-1]) # - g


#-----------------------------------------------------------------------------------------------------------------------
# D:\Программы\ProjectPyton\BasiesStructures\Scripts\python.exe "D:\Программы\ProjectPyton\Module 1.
# GIT Practice. Basic Data Structures\Program Organization and String Methods (Honework).py"
# Ни хрена не успеваю
# <class 'str'>
# 19
# НИ ХРЕНА НЕ УСПЕВАЮ
# ни хрена не успеваю
# НИ ХРЕНА НЕ УСПЕВАЮ
# Ни#хрена#не#успеваю
# m
# g

# Process finished with exit code 0
#-----------------------------------------------------------------------------------------------------------------------

